In [6]:
# Import SparkSession
from pyspark.sql import SparkSession
from pyspark.sql.functions import col, regexp_replace
from pyspark.sql.functions import when

# Create SparkSession
spark = SparkSession.builder \
    .appName("Read CSV Clients_15") \
    .getOrCreate()

# Read CSV into DataFrame
df = spark.read.csv("./data/Clients_15.csv", header=True, inferSchema=True)

# Display DataFrame
df.show()

+---+-----+----+------------------+----------------+------------+---------------+
|age| sexe|taux|situationFamiliale|nbEnfantsAcharge|2eme voiture|immatriculation|
+---+-----+----+------------------+----------------+------------+---------------+
| 40|    F| 513|         En Couple|               2|       false|     8638 TQ 28|
| 47|    M| 546|       C�libataire|               0|       false|     1673 XO 64|
| 27|Homme| 505|         En Couple|               0|       false|     3226 JN 69|
| 26|    M| 527|         En Couple|               1|       false|     4198 RJ 72|
| 35|    M| 489|         En Couple|               3|       false|     4491 LL 56|
| 20|    M|1059|       C�libataire|               0|       false|     9433 KO 45|
| 19|    M| 507|       C�libataire|               0|       false|     4945 ZP 98|
| 76|    F|1222|         En Couple|               0|       false|      376 WN 83|
| 26|    M| 154|       C�libataire|               0|       false|     5175 XJ 18|
| 61|    M|1292|         En Couple|               0|       false|      931 PG 41|
| 83|    M| 593|       C�libataire|               0|       false|     6836 BP 45|
| 40|    M|1039|         En Couple|               1|       false|     9044 VD 92|
| 29|    M| 536|         En Couple|               1|       false|     1829 HQ 31|
| 47|    F| 209|       C�libataire|               0|       false|     3807 EZ 21|
| 47|    M| 563|         En Couple|               2|       false|     3382 YO 89|
| 56|    F| 165|       C�libataire|               0|       false|     1044 XB 74|
| 47|    M| 463|       C�libataire|               0|       false|     6504 AR 40|
| 20|    M| 159|         En Couple|               3|        true|     9066 RZ 11|
| 25|    F| 587|       C�libataire|               0|       false|     2041 GB 89|
| 78|    M| 559|       C�libataire|               0|       false|     1220 ZA 66|
+---+-----+----+------------------+----------------+------------+---------------+
only showing top 20 rows

In [7]:
from pyspark.sql.functions import when

# Define the DataFrame with replacements
df = df.withColumn("situationFamiliale", regexp_replace(col("situationFamiliale"), "�", "e")) \
               .withColumn("sexe", 
                           when(col("sexe").rlike("Homme|Masculin"), "M")
                           .when(col("sexe").rlike("Femme|F�minin"), "F")
                           .otherwise(col("sexe")))
                
                

# Display the cleaned DataFrame
df.show()

+---+----+----+------------------+----------------+------------+---------------+
|age|sexe|taux|situationFamiliale|nbEnfantsAcharge|2eme voiture|immatriculation|
+---+----+----+------------------+----------------+------------+---------------+
| 40|   F| 513|         En Couple|               2|       false|     8638 TQ 28|
| 47|   M| 546|       Celibataire|               0|       false|     1673 XO 64|
| 27|   M| 505|         En Couple|               0|       false|     3226 JN 69|
| 26|   M| 527|         En Couple|               1|       false|     4198 RJ 72|
| 35|   M| 489|         En Couple|               3|       false|     4491 LL 56|
| 20|   M|1059|       Celibataire|               0|       false|     9433 KO 45|
| 19|   M| 507|       Celibataire|               0|       false|     4945 ZP 98|
| 76|   F|1222|         En Couple|               0|       false|      376 WN 83|
| 26|   M| 154|       Celibataire|               0|       false|     5175 XJ 18|
| 61|   M|1292|         En Couple|               0|       false|      931 PG 41|
| 83|   M| 593|       Celibataire|               0|       false|     6836 BP 45|
| 40|   M|1039|         En Couple|               1|       false|     9044 VD 92|
| 29|   M| 536|         En Couple|               1|       false|     1829 HQ 31|
| 47|   F| 209|       Celibataire|               0|       false|     3807 EZ 21|
| 47|   M| 563|         En Couple|               2|       false|     3382 YO 89|
| 56|   F| 165|       Celibataire|               0|       false|     1044 XB 74|
| 47|   M| 463|       Celibataire|               0|       false|     6504 AR 40|
| 20|   M| 159|         En Couple|               3|        true|     9066 RZ 11|
| 25|   F| 587|       Celibataire|               0|       false|     2041 GB 89|
| 78|   M| 559|       Celibataire|               0|       false|     1220 ZA 66|
+---+----+----+------------------+----------------+------------+---------------+
only showing top 20 rows

In [9]:
# Define the path for the cleaned CSV file
output_path = "./Cleaned/Client_15"

# Save the cleaned DataFrame to a new CSV file
df.write.csv(output_path, header=True, mode="overwrite")

# Display a message to confirm the save
print("Cleaned DataFrame has been saved to:", output_path)

Cleaned DataFrame has been saved to: ./Cleaned/Client_15

In [4]:
# Set the configuration to display all rows

from pyspark.sql.functions import col
spark.conf.set("spark.sql.repl.eagerEval.enabled", True)

# Iterate over each column
for column_name in cleaned_df.columns:
    # Filter rows with null or empty values in the column
    empty_values_df = cleaned_df.filter((col(column_name) == "") | col(column_name).isNull() | (col(column_name) == "?") )
    
    # Check if there are any empty values in the column
    if empty_values_df.count() > 0:
        print("There are empty values in the column:", column_name)
        # Display the rows with empty values
        empty_values_df.show()
    else:
        print("There are no empty values in the column:", column_name)

NameError: name 'cleaned_df' is not defined

In [5]:
df

+---+----+----+------------------+----------------+------------+---------------+
|age|sexe|taux|situationFamiliale|nbEnfantsAcharge|2eme voiture|immatriculation|
+---+----+----+------------------+----------------+------------+---------------+
| 40|   F| 513|         En Couple|               2|       false|     8638 TQ 28|
| 47|   M| 546|       Celibataire|               0|       false|     1673 XO 64|
| 27|   M| 505|         En Couple|               0|       false|     3226 JN 69|
| 26|   M| 527|         En Couple|               1|       false|     4198 RJ 72|
| 35|   M| 489|         En Couple|               3|       false|     4491 LL 56|
| 20|   M|1059|       Celibataire|               0|       false|     9433 KO 45|
| 19|   M| 507|       Celibataire|               0|       false|     4945 ZP 98|
| 76|   F|1222|         En Couple|               0|       false|      376 WN 83|
| 26|   M| 154|       Celibataire|               0|       false|     5175 XJ 18|
| 61|   M|1292|         En Couple|               0|       false|      931 PG 41|
| 83|   M| 593|       Celibataire|               0|       false|     6836 BP 45|
| 40|   M|1039|         En Couple|               1|       false|     9044 VD 92|
| 29|   M| 536|         En Couple|               1|       false|     1829 HQ 31|
| 47|   F| 209|       Celibataire|               0|       false|     3807 EZ 21|
| 47|   M| 563|         En Couple|               2|       false|     3382 YO 89|
| 56|   F| 165|       Celibataire|               0|       false|     1044 XB 74|
| 47|   M| 463|       Celibataire|               0|       false|     6504 AR 40|
| 20|   M| 159|         En Couple|               3|        true|     9066 RZ 11|
| 25|   F| 587|       Celibataire|               0|       false|     2041 GB 89|
| 78|   M| 559|       Celibataire|               0|       false|     1220 ZA 66|
+---+----+----+------------------+----------------+------------+---------------+
only showing top 20 rows

In [6]:
df

DataFrame[age: string, sexe: string, taux: string, situationFamiliale: string, nbEnfantsAcharge: string, 2eme voiture: string, immatriculation: string]

In [7]:
from pyspark.sql import SparkSession
from pyspark.sql.functions import col

# Créer la session Spark
spark = SparkSession.builder \
    .appName("Count Null Rows") \
    .getOrCreate()



# Initialiser le compteur
total_null_rows = 0

# Parcourir toutes les colonnes du DataFrame
for col_name in df.columns:
    # Compter le nombre de lignes avec des valeurs nulles dans cette colonne
    null_rows_count = df.filter(df[col_name].isNull()).count()
    # Ajouter au compteur total
    total_null_rows += null_rows_count
    # Afficher le nombre de lignes avec des valeurs nulles dans cette colonne
    print("Nombre de lignes avec des valeurs nulles dans la colonne", col_name, ":", null_rows_count)

# Afficher le nombre total de lignes avec des valeurs nulles dans le DataFrame
print("Nombre total de lignes avec des valeurs nulles dans le DataFrame :", total_null_rows)

Nombre de lignes avec des valeurs nulles dans la colonne age : 0
Nombre de lignes avec des valeurs nulles dans la colonne sexe : 0
Nombre de lignes avec des valeurs nulles dans la colonne taux : 0
Nombre de lignes avec des valeurs nulles dans la colonne situationFamiliale : 0
Nombre de lignes avec des valeurs nulles dans la colonne nbEnfantsAcharge : 0
Nombre de lignes avec des valeurs nulles dans la colonne 2eme voiture : 0
Nombre de lignes avec des valeurs nulles dans la colonne immatriculation : 0
Nombre total de lignes avec des valeurs nulles dans le DataFrame : 0

In [8]:
df

DataFrame[age: string, sexe: string, taux: string, situationFamiliale: string, nbEnfantsAcharge: string, 2eme voiture: string, immatriculation: string]

In [9]:
from pyspark.sql import SparkSession
from pyspark.sql.functions import col

# Créer la session Spark
spark = SparkSession.builder \
    .appName("Count Null Rows") \
    .getOrCreate()



# Initialiser le compteur
total_null_rows = 0

# Parcourir toutes les colonnes du DataFrame
for col_name in df.columns:
    # Compter le nombre de lignes avec des valeurs nulles dans cette colonne
    null_rows_count = df.filter(df[col_name].isNull()).count()
    # Ajouter au compteur total
    total_null_rows += null_rows_count
    # Afficher le nombre de lignes avec des valeurs nulles dans cette colonne
    print("Nombre de lignes avec des valeurs nulles dans la colonne", col_name, ":", null_rows_count)

# Afficher le nombre total de lignes avec des valeurs nulles dans le DataFrame
print("Nombre total de lignes avec des valeurs nulles dans le DataFrame :", total_null_rows)

Nombre de lignes avec des valeurs nulles dans la colonne age : 0
Nombre de lignes avec des valeurs nulles dans la colonne sexe : 0
Nombre de lignes avec des valeurs nulles dans la colonne taux : 0
Nombre de lignes avec des valeurs nulles dans la colonne situationFamiliale : 0
Nombre de lignes avec des valeurs nulles dans la colonne nbEnfantsAcharge : 0
Nombre de lignes avec des valeurs nulles dans la colonne 2eme voiture : 0
Nombre de lignes avec des valeurs nulles dans la colonne immatriculation : 0
Nombre total de lignes avec des valeurs nulles dans le DataFrame : 0

In [4]:
# Remplacer les valeurs nulles dans la colonne 'immatriculation' par '3467 SB 72|'
df = df.fillna({'nbEnfantsAcharge': '2'})

# Afficher le DataFrame après remplacement
print("DataFrame après remplacement des valeurs nulles :")
df.show()

DataFrame après remplacement des valeurs nulles :
+---+-----+----+------------------+----------------+------------+---------------+
|age| sexe|taux|situationFamiliale|nbEnfantsAcharge|2eme voiture|immatriculation|
+---+-----+----+------------------+----------------+------------+---------------+
| 40|    F| 513|         En Couple|               2|       false|     8638 TQ 28|
| 47|    M| 546|       C�libataire|               0|       false|     1673 XO 64|
| 27|Homme| 505|         En Couple|               0|       false|     3226 JN 69|
| 26|    M| 527|         En Couple|               1|       false|     4198 RJ 72|
| 35|    M| 489|         En Couple|               3|       false|     4491 LL 56|
| 20|    M|1059|       C�libataire|               0|       false|     9433 KO 45|
| 19|    M| 507|       C�libataire|               0|       false|     4945 ZP 98|
| 76|    F|1222|         En Couple|               0|       false|      376 WN 83|
| 26|    M| 154|       C�libataire|               0|       false|     5175 XJ 18|
| 61|    M|1292|         En Couple|               0|       false|      931 PG 41|
| 83|    M| 593|       C�libataire|               0|       false|     6836 BP 45|
| 40|    M|1039|         En Couple|               1|       false|     9044 VD 92|
| 29|    M| 536|         En Couple|               1|       false|     1829 HQ 31|
| 47|    F| 209|       C�libataire|               0|       false|     3807 EZ 21|
| 47|    M| 563|         En Couple|               2|       false|     3382 YO 89|
| 56|    F| 165|       C�libataire|               0|       false|     1044 XB 74|
| 47|    M| 463|       C�libataire|               0|       false|     6504 AR 40|
| 20|    M| 159|         En Couple|               3|        true|     9066 RZ 11|
| 25|    F| 587|       C�libataire|               0|       false|     2041 GB 89|
| 78|    M| 559|       C�libataire|               0|       false|     1220 ZA 66|
+---+-----+----+------------------+----------------+------------+---------------+
only showing top 20 rows

In [12]:
from pyspark.sql import SparkSession
from pyspark.sql.functions import col

# Créer la session Spark
spark = SparkSession.builder \
    .appName("Count Null Rows") \
    .getOrCreate()



# Initialiser le compteur
total_null_rows = 0

# Parcourir toutes les colonnes du DataFrame
for col_name in df.columns:
    # Compter le nombre de lignes avec des valeurs nulles dans cette colonne
    null_rows_count = df.filter(df[col_name].isNull()).count()
    # Ajouter au compteur total
    total_null_rows += null_rows_count
    # Afficher le nombre de lignes avec des valeurs nulles dans cette colonne
    print("Nombre de lignes avec des valeurs nulles dans la colonne", col_name, ":", null_rows_count)

# Afficher le nombre total de lignes avec des valeurs nulles dans le DataFrame
print("Nombre total de lignes avec des valeurs nulles dans le DataFrame :", total_null_rows)

Nombre de lignes avec des valeurs nulles dans la colonne age : 0
Nombre de lignes avec des valeurs nulles dans la colonne sexe : 0
Nombre de lignes avec des valeurs nulles dans la colonne taux : 0
Nombre de lignes avec des valeurs nulles dans la colonne situationFamiliale : 0
Nombre de lignes avec des valeurs nulles dans la colonne nbEnfantsAcharge : 0
Nombre de lignes avec des valeurs nulles dans la colonne 2eme voiture : 0
Nombre de lignes avec des valeurs nulles dans la colonne immatriculation : 0
Nombre total de lignes avec des valeurs nulles dans le DataFrame : 0

In [13]:
# Remplacer les valeurs nulles dans la colonne 'immatriculation' par '3467 SB 72|'
df = df.fillna({'2eme voiture': 'false'})

# Afficher le DataFrame après remplacement
print("DataFrame après remplacement des valeurs nulles :")
df.show()

DataFrame après remplacement des valeurs nulles :
+---+----+----+------------------+----------------+------------+---------------+
|age|sexe|taux|situationFamiliale|nbEnfantsAcharge|2eme voiture|immatriculation|
+---+----+----+------------------+----------------+------------+---------------+
| 40|   F| 513|         En Couple|               2|       false|     8638 TQ 28|
| 47|   M| 546|       Celibataire|               0|       false|     1673 XO 64|
| 27|   M| 505|         En Couple|               0|       false|     3226 JN 69|
| 26|   M| 527|         En Couple|               1|       false|     4198 RJ 72|
| 35|   M| 489|         En Couple|               3|       false|     4491 LL 56|
| 20|   M|1059|       Celibataire|               0|       false|     9433 KO 45|
| 19|   M| 507|       Celibataire|               0|       false|     4945 ZP 98|
| 76|   F|1222|         En Couple|               0|       false|      376 WN 83|
| 26|   M| 154|       Celibataire|               0|       false|     5175 XJ 18|
| 61|   M|1292|         En Couple|               0|       false|      931 PG 41|
| 83|   M| 593|       Celibataire|               0|       false|     6836 BP 45|
| 40|   M|1039|         En Couple|               1|       false|     9044 VD 92|
| 29|   M| 536|         En Couple|               1|       false|     1829 HQ 31|
| 47|   F| 209|       Celibataire|               0|       false|     3807 EZ 21|
| 47|   M| 563|         En Couple|               2|       false|     3382 YO 89|
| 56|   F| 165|       Celibataire|               0|       false|     1044 XB 74|
| 47|   M| 463|       Celibataire|               0|       false|     6504 AR 40|
| 20|   M| 159|         En Couple|               3|        true|     9066 RZ 11|
| 25|   F| 587|       Celibataire|               0|       false|     2041 GB 89|
| 78|   M| 559|       Celibataire|               0|       false|     1220 ZA 66|
+---+----+----+------------------+----------------+------------+---------------+
only showing top 20 rows

In [5]:
# Remplacer les valeurs nulles dans la colonne 'immatriculation' par '3467 SB 72|'
df = df.fillna({'immatriculation': '8638 TQ 28'})

# Afficher le DataFrame après remplacement
print("DataFrame après remplacement des valeurs nulles :")
df.show()

DataFrame après remplacement des valeurs nulles :
+---+-----+----+------------------+----------------+------------+---------------+
|age| sexe|taux|situationFamiliale|nbEnfantsAcharge|2eme voiture|immatriculation|
+---+-----+----+------------------+----------------+------------+---------------+
| 40|    F| 513|         En Couple|               2|       false|     8638 TQ 28|
| 47|    M| 546|       C�libataire|               0|       false|     1673 XO 64|
| 27|Homme| 505|         En Couple|               0|       false|     3226 JN 69|
| 26|    M| 527|         En Couple|               1|       false|     4198 RJ 72|
| 35|    M| 489|         En Couple|               3|       false|     4491 LL 56|
| 20|    M|1059|       C�libataire|               0|       false|     9433 KO 45|
| 19|    M| 507|       C�libataire|               0|       false|     4945 ZP 98|
| 76|    F|1222|         En Couple|               0|       false|      376 WN 83|
| 26|    M| 154|       C�libataire|               0|       false|     5175 XJ 18|
| 61|    M|1292|         En Couple|               0|       false|      931 PG 41|
| 83|    M| 593|       C�libataire|               0|       false|     6836 BP 45|
| 40|    M|1039|         En Couple|               1|       false|     9044 VD 92|
| 29|    M| 536|         En Couple|               1|       false|     1829 HQ 31|
| 47|    F| 209|       C�libataire|               0|       false|     3807 EZ 21|
| 47|    M| 563|         En Couple|               2|       false|     3382 YO 89|
| 56|    F| 165|       C�libataire|               0|       false|     1044 XB 74|
| 47|    M| 463|       C�libataire|               0|       false|     6504 AR 40|
| 20|    M| 159|         En Couple|               3|        true|     9066 RZ 11|
| 25|    F| 587|       C�libataire|               0|       false|     2041 GB 89|
| 78|    M| 559|       C�libataire|               0|       false|     1220 ZA 66|
+---+-----+----+------------------+----------------+------------+---------------+
only showing top 20 rows

In [15]:
from pyspark.sql import SparkSession
from pyspark.sql.functions import col

# Créer la session Spark
spark = SparkSession.builder \
    .appName("Count Null Rows") \
    .getOrCreate()



# Initialiser le compteur
total_null_rows = 0

# Parcourir toutes les colonnes du DataFrame
for col_name in df.columns:
    # Compter le nombre de lignes avec des valeurs nulles dans cette colonne
    null_rows_count = df.filter(df[col_name].isNull()).count()
    # Ajouter au compteur total
    total_null_rows += null_rows_count
    # Afficher le nombre de lignes avec des valeurs nulles dans cette colonne
    print("Nombre de lignes avec des valeurs nulles dans la colonne", col_name, ":", null_rows_count)

# Afficher le nombre total de lignes avec des valeurs nulles dans le DataFrame
print("Nombre total de lignes avec des valeurs nulles dans le DataFrame :", total_null_rows)

Nombre de lignes avec des valeurs nulles dans la colonne age : 0
Nombre de lignes avec des valeurs nulles dans la colonne sexe : 0
Nombre de lignes avec des valeurs nulles dans la colonne taux : 0
Nombre de lignes avec des valeurs nulles dans la colonne situationFamiliale : 0
Nombre de lignes avec des valeurs nulles dans la colonne nbEnfantsAcharge : 0
Nombre de lignes avec des valeurs nulles dans la colonne 2eme voiture : 0
Nombre de lignes avec des valeurs nulles dans la colonne immatriculation : 0
Nombre total de lignes avec des valeurs nulles dans le DataFrame : 0

In [23]:
# Define the path for the cleaned CSV file
output_path = "./Cleaned/Client_15"

# Save the cleaned DataFrame to a new CSV file
cleaned_df.write.csv(output_path, header=True, mode="overwrite")

# Display a message to confirm the save
print("Cleaned DataFrame has been saved to:", output_path)

NameError: name 'cleaned_df' is not defined

In [20]:
filtered_df = df.filter(df['age'] == 23)

filtered_df

+---+----+----+------------------+----------------+------------+---------------+
|age|sexe|taux|situationFamiliale|nbEnfantsAcharge|2eme voiture|immatriculation|
+---+----+----+------------------+----------------+------------+---------------+
| 23|   M| 242|         En Couple|               0|       false|     1134 BL 57|
| 23|   M| 547|         En Couple|               2|       false|     7528 VW 49|
| 23|   M| 172|         En Couple|               3|       false|     6565 DK 65|
| 23|   F| 246|         En Couple|               4|       false|     9959 AK 55|
| 23|   F| 444|       Celibataire|               0|       false|     3257 IE 20|
| 23|   F| 427|       Celibataire|               0|       false|      985 FB 17|
| 23|   M|1255|         En Couple|               0|       false|     8380 IS 80|
| 23|   M| 215|       Celibataire|               0|       false|     6111 IK 72|
| 23|   M|1241|       Celibataire|               0|       false|     9116 LM 92|
| 23|   F| 529|         En Couple|               0|       false|     6383 IY 76|
| 23|   M| 451|       Celibataire|               0|       false|     2179 WB 91|
| 23|   F| 862|       Celibataire|               0|       false|     5437 WI 93|
| 23|   M| 447|         En Couple|               2|       false|      280 DM 57|
| 23|   F| 759|         En Couple|               0|       false|     7461 TU 12|
| 23|   M| 512|         En Couple|               0|       false|     6794 LZ 59|
| 23|   F| 223|         En Couple|               4|        true|     8472 YS 23|
| 23|   M| 218|         En Couple|               0|        true|     5503 DI 42|
| 23|   F|1360|       Celibataire|               0|       false|     5177 OS 83|
| 23|   M| 526|         En Couple|               4|       false|     1314 WP 10|
| 23|   M| 209|         En Couple|               1|       false|      612 XF 11|
+---+----+----+------------------+----------------+------------+---------------+
only showing top 20 rows